openfoam_exercises/shmexercise/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          400;
        startFace       84864;
    }
    outlet
    {
        type            patch;
        nFaces          400;
        startFace       85264;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       85664;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       86464;
    }
    sideWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       87264;
    }
    sphere
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1096;
        startFace       88864;
    }
)

// ************************************************************************* //
