openfoam_exercises/shmexercise/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;   // coordinates in metres

// Box: 4 m long x 2 m tall x 2 m wide
// Sphere at (1.0, 1.0, 1.0), radius 0.25 m — fits well inside
vertices
(
    (0 0 0)   // 0
    (4 0 0)   // 1
    (4 2 0)   // 2
    (0 2 0)   // 3
    (0 0 2)   // 4
    (4 0 2)   // 5
    (4 2 2)   // 6
    (0 2 2)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (40 20 20)
    simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 4 7 3));
    }
    outlet
    {
        type patch;
        faces ((1 2 6 5));
    }
    topWall
    {
        type wall;
        faces ((3 7 6 2));
    }
    bottomWall
    {
        type wall;
        faces ((0 1 5 4));
    }
    sideWalls
    {
        type wall;
        faces
        (
            (0 3 2 1)   // front (z=0)
            (4 5 6 7)   // back  (z=2)
        );
    }
);
